In [3]:
#importing libraries
import pandas as pd
import mysql.connector
import numpy as np

In [6]:
# csv to dataframe
df_buses_1=pd.read_csv(r"C:\Users\gokul\Desktop\capstoneproject\redbus\df_buses_1.csv")
df_buses_2=pd.read_csv(r"C:\Users\gokul\Desktop\capstoneproject\redbus\df_buses_2.csv")
df_buses_3=pd.read_csv(r"C:\Users\gokul\Desktop\capstoneproject\redbus\df_buses_3.csv")
df_buses_4=pd.read_csv(r"C:\Users\gokul\Desktop\capstoneproject\redbus\df_buses_4.csv")
df_buses_5=pd.read_csv(r"C:\Users\gokul\Desktop\capstoneproject\redbus\df_buses_5.csv")
df_buses_6=pd.read_csv(r"C:\Users\gokul\Desktop\capstoneproject\redbus\df_buses6.csv")
df_buses_7=pd.read_csv(r"C:\Users\gokul\Desktop\capstoneproject\redbus\df_buses7.csv")
df_buses_8=pd.read_csv(r"C:\Users\gokul\Desktop\capstoneproject\redbus\df_buses8.csv")
df_buses_9=pd.read_csv(r"C:\Users\gokul\Desktop\capstoneproject\redbus\df_buses9.csv")
df_buses_10=pd.read_csv(r"C:\Users\gokul\Desktop\capstoneproject\redbus\df_buses10.csv")

Final_df=pd.concat([df_buses_1,df_buses_2,df_buses_3,df_buses_4,df_buses_5,df_buses_6,
                    df_buses_7,df_buses_8,df_buses_9,df_buses_10],ignore_index=True)
Final_df

,Bus_name,Bus_type,Start_time,End_time,Total_duration,Price,Seats_Available,Ratings,Route_link,Route_name
0,APSRTC - 3722,"SUPER LUXURY (NON-AC, 2 + 2 PUSH BACK)",14:30,20:45,06h 15m,INR 412,30 Seats available,3.2\n27,https://www.redbus.in/bus-tickets/hyderabad-to...,Hyderabad to Vijayawada
1,APSRTC - 3859,DOLPHIN CRUISE (VOLVO / SCANIA A.C Multi Axle),15:15,21:25,06h 10m,INR 615,32 Seats available,3.1\n73,https://www.redbus.in/bus-tickets/hyderabad-to...,Hyderabad to Vijayawada
2,APSRTC - 3356,NIGHT RIDER (SEATER CUM SLEEPER),15:45,22:45,07h 00m,INR 639,33 Seats available,3.8\n28,https://www.redbus.in/bus-tickets/hyderabad-to...,Hyderabad to Vijayawada
3,APSRTC - 3546,AMARAVATHI (VOLVO / SCANIA A.C Multi Axle),16:15,22:30,06h 15m,INR 615,34 Seats available,3.7\n86,https://www.redbus.in/bus-tickets/hyderabad-to...,Hyderabad to Vijayawada
4,APSRTC - 3500,"SUPER LUXURY (NON-AC, 2 + 2 PUSH BACK)",16:20,00:45,08h 25m,INR 469,18 Seats available,3.5\n11,https://www.redbus.in/bus-tickets/hyderabad-to...,Hyderabad to Vijayawada
...,...,...,...,...,...,...,...,...,...,...
2358,Satadal Travels,A/C Seater (2+2),14:56,18:15,03h 19m,INR 170,40 Seats available,3.8,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
2359,Diamond City Service,A/C Executive (2+3),15:10,18:55,03h 45m,170,47 Seats available,4.5\n454,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
2360,Droupadi Paribahan,A/C Seater (2+3),14:10,16:58,02h 48m,INR 160,61 Seats available,2.7\n31,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
2361,KRISHNAKALI,A/C Seater (2+3),14:45,17:30,02h 45m,INR 165,61 Seats available,2.2\n50,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
2362,Droupadi Bus Service,Non AC Seater (2+3),16:20,19:10,02h 50m,INR 121,54 Seats available,2.7\n20,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia

In [7]:
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2363 entries, 0 to 2362
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         2363 non-null   object
 1   Bus_type         2363 non-null   object
 2   Start_time       2363 non-null   object
 3   End_time         2363 non-null   object
 4   Total_duration   2363 non-null   object
 5   Price            2363 non-null   object
 6   Seats_Available  2363 non-null   object
 7   Ratings          2363 non-null   object
 8   Route_link       2363 non-null   object
 9   Route_name       2363 non-null   object
dtypes: object(10)
memory usage: 184.7+ KB

In [8]:
Final_df["Price"]=Final_df["Price"].str.replace("INR","")
Final_df["Price"]=Final_df["Price"].astype(float)
Final_df["Price"].fillna(0)

0       412.0
1       615.0
2       639.0
3       615.0
4       469.0
        ...
2358    170.0
2359    170.0
2360    160.0
2361    165.0
2362    121.0
Name: Price, Length: 2363, dtype: float64

In [10]:
Final_df["Ratings"]=Final_df["Ratings"].str.replace("New","")
Final_df["Ratings"]=Final_df["Ratings"].str.strip()
Final_df["Ratings"]=Final_df["Ratings"].str.split().str[0]
Final_df["Ratings"] = pd.to_numeric(Final_df["Ratings"], errors='coerce')
Final_df["Ratings"].fillna(0,inplace=True)

C:\Users\gokul\AppData\Local\Temp\ipykernel_7948\2582007703.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  Final_df["Ratings"].fillna(0,inplace=True)

In [11]:
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2363 entries, 0 to 2362
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         2363 non-null   object
 1   Bus_type         2363 non-null   object
 2   Start_time       2363 non-null   object
 3   End_time         2363 non-null   object
 4   Total_duration   2363 non-null   object
 5   Price            2363 non-null   float64
 6   Seats_Available  2363 non-null   object
 7   Ratings          2363 non-null   float64
 8   Route_link       2363 non-null   object
 9   Route_name       2363 non-null   object
dtypes: float64(2), object(8)
memory usage: 184.7+ KB

In [12]:
Final_df = Final_df[Final_df["Price"] <= 7000]

In [13]:
# replacing the nan value
Final_df = Final_df.replace({np.nan: None})

In [14]:
# change dataframe to csv
path=r"C:\Users\gokul\Desktop\capstoneproject\redbus\final_busdetails_df.csv"
Final_df.to_csv(path,index=False)

# Create Sql connection

In [15]:
import pymysql
connection = pymysql.connect(
    host='localhost',  # Your host
    user='root',       # Your MySQL username
    password='123456789',  # Your MySQL password
    
)
mycursor = connection.cursor()
mycursor

In [17]:
mycursor.execute("CREATE DATABASE IF NOT EXISTS RED_BUS_DETAILS")

1

In [21]:
query = "drop database RED_BUS_DETAILS"
mycursor.execute(query)

0

In [23]:
# Table Creation
mycursor.execute("CREATE DATABASE IF NOT EXISTS RED_BUS_DETAILS")
mycursor.execute("USE RED_BUS_DETAILS")
mycursor.execute('''CREATE TABLE IF NOT EXISTS bus_details(
                  ID INT AUTO_INCREMENT PRIMARY KEY,
                  Bus_name VARCHAR(255) NOT NULL,
                  Bus_type VARCHAR(255) NOT NULL,
                  Start_time VARCHAR(255) NOT NULL,
                  End_time VARCHAR(255) NOT NULL,
                  Total_duration VARCHAR(255) NOT NULL,
                  Price FLOAT NULL,
                  Seats_Available VARCHAR(255) NOT NULL,
                  Ratings Float NULL,
                  Route_link VARCHAR(255) NULL,
                  Route_name VARCHAR(255) NULL
                  )''')
print("Table Created successfully")

Table Created successfully

In [26]:
# SQL query to insert data into bus_details table
insert_query = '''INSERT INTO bus_details(
                    Bus_name,
                    Bus_type,
                    Start_time,
                    End_time,
                    Total_duration,
                    Price,
                    Seats_Available,
                    Ratings,
                    Route_link,
                    Route_name)
                  VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'''
data = Final_df.values.tolist()

mycursor.executemany(insert_query, data)

connection.commit()

print("Values inserted successfully")

Values inserted successfully